Revit 2027 API
ParameterTypeId.StairsAttrMonolithicStairs Property
 "Monolithic Stairs"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrMonolithicStairs { get; }
Public Shared ReadOnly Property StairsAttrMonolithicStairs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrMonolithicStairs {
	ForgeTypeId^ get ();
}
static member StairsAttrMonolithicStairs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace